Sports_Ball_Shop/app/controllers/shops_controller.rb

SELECT "shops".* FROM "shops"
---
	def index
		@shops = Shop.all

SELECT "admins".* FROM "admins" WHERE (user_name = 'Nahid')
SELECT "shops".* FROM "shops"
---
	def admin_index
		@admin = Admin.where('user_name = ? AND password = ?', params[:user_name], params[:password])
		@shops = Shop.all

SELECT "shops".* FROM "shops"
---
	def show_index
		@shops = Shop.all

SELECT "shops".* FROM "shops" WHERE (Brand = 'Carlton Shuttlecocks' OR Type = 'Carlton Shuttlecocks')
---
	def find
		@shops = Shop.where('Brand = ? OR Type = ?', params[:search_string], params[:search_string])

SELECT "shops".* FROM "shops" WHERE (Brand = 'Badminton' OR Type = 'Badminton')
---
	def user_find
		@shops = Shop.where('Brand = ? OR Type = ?', params[:search], params[:search])

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "46"]]
---
	def buy
		@shop = Shop.find(params[:id])

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@shop = Shop.find(params[:id])

INSERT INTO "shops" ("Brand", "Price", "Quantity", "Sold", "Type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@shop = Shop.new(params[:shop])
		respond_to do |format|
			if @shop.save

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "shops" SET "Type" = 'Basket Ball', "Brand" = 'Odidas', "Price" = 34, "Quantity" = 2, "Sold" = 3, "updated_at" = '2014-11-11 18:08:25.188978' WHERE "shops"."id" = 27
---
	def update
		@shop = Shop.find(params[:id])

		respond_to do |format|
			if @shop.update_attributes(params[:shop])

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "shops" WHERE "shops"."id" = ?  [["id", 4]]
---
	def destroy
		@shop = Shop.find(params[:id])
		@shop.destroy